video_system/core_onvif/onvifsend/PtzGotoPreset.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  %1
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GotoPreset xmlns="http://www.onvif.org/ver20/ptz/wsdl">
      <ProfileToken>%2</ProfileToken>
      <PresetToken>%3</PresetToken>
    </GotoPreset>
  </s:Body>
</s:Envelope>